{"_id":{"$oid":"64f5d33c431c7b9df9f719dd"},"Title":"Ran","Description":"Ran (Japanese: 乱; romaij: ran, literally: chaos or tumult)  is an epic action drama directed, edited and co-written by Akira Kurosawa. The plot derives from William Shakespeare's King Lear and includes segments based on legends of the daimyō Mōri Motonari. The film stars Tatsuya Nakadai as an elderly warlord who decides to abdicate as ruler in favour of his three sons. Dividing his kingdom between them, he ultimately ignites a rivalry that will fatally tear the clan apart between betrayal and quest for power. As Kurosawa's last epic, Ran has often been cited as among his finest achievements and is widely regarded as one of the greatest films ever made. With a budget of $11 million it was the most expensive Japanese film produced up to that time. The film was hailed for its powerful images and use of colour; costume designer Emi Wada won an Academy Award for Best Costume Design for her work, and Kurosawa received his only career nomination for Best Director. The distinctive film score, inspired by Gustav Mahler, was composed by Toru Takemitsu.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction intended to be more serious than humorous in tone. Drama of this kind is usually qualified with additional terms that specify its particular super-genre, macro-genre, or micro-genre, such as soap opera, police crime drama, political drama, legal drama, historical drama, teen drama, comedy drama. These terms tend to indicate a particular setting or subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods. To these ends, a primary element in a drama is the occurrence of conflict—emotional, social, or otherwise—and its resolution in the course of the storyline."},"ReleaseYear":"1985","Director":{"Name":"Akira Kurosawa","Bio":"Akira Kurosawa was a Japanese filmmaker who directed 30 films in a career spanning over five decades. He is widely regarded as one of the greatest and most influential filmmakers in the history of cinema. He displayed a bold, dynamic style, influenced by Western cinema yet distinct from it. He made his debut as a director during World War II with the popular action film Sanshiro Sugata (1943). After the war, the acclaimed Drunken Angel (1948), in which Kurosawa cast the then unknown actor Toshiro Mifune in a starring role, cemented his reputation as one of the most important young filmmakers in Japan. The two men would go on to collaborate on another fifteen films. Rashomon (1950), which premiered in Tokyo, became the surprise winner of the Golden Lion at the 1951 Venice Film Festival. The commercial and critical success of that film opened up Western film markets for the first time to the products of the Japanese film industry, which in turn led to international recognition for other Japanese filmmakers. His most prominent work includes: Ikiru (1952), Seven Samurai (1954), Throne of Blood (1957), Yojimbo (1961) and High and Low (1963), Kagemusha (1980) and Ran (1985).","Birth":"1910","Death":"1998"},"ImagePath":"7O5x0XZTrKeE9nY1wAYbtGkZCQG.jpg (1200×1800) (tmdb.org)","Feature":true,"bio":"Akira Kurosawa was a Japanese filmmaker who directed 30 films in a career spanning over five decades. He is regarded as one of the greatest and most influential filmmakers in the history of cinema. He displayed a bold, dynamic style, influenced by Western cinema yet distinct from it. He made his debut as a director during World War II with the popular action film Sanshiro Sugata (1943). After the war, the acclaimed Drunken Angel (1948), in which Kurosawa cast the then unknown actor Toshiro Mifune in a starring role, cemented his reputation as one of the most important young filmmakers in Japan. The two men would go on to collaborate on another fifteen films. Rashomon (1950), which premiered in Tokyo, became the surprise winner of the Golden Lion at the 1951 Venice Film Festival. The commercial and critical success of that film opened up Western film markets for the first time to the products of the Japanese film industry, which in turn led to international recognition for other Japanese filmmakers. His most prominent work includes: Ikiru (1952), Seven Samurai (1954), Throne of Blood (1957), Yojimbo (1961) and High and Low (1963), Kagemusha (1980) and Ran (1985)."}
{"_id":{"$oid":"64f5fedc2adbfe646492223c"},"Description":"Murakami (Toshirô Mifune) is a young and inexperienced detective on the Tokyo police force. While riding a crowded bus on a hot summer day, he discovers that his gun has been stolen out of its holster. Reluctant to lose face by reporting the gun missing, Murakami first dives alone into the depths of postwar Tokyo’s poverty-stricken slums and criminal underworld, but when the missing gun is implicated in a crime spree, a more experienced detective (Takashi Shimura) lends his expertise. Stray Dog (Japanese: 野良犬; romaji: nora inu; literally: stray dog) is a Japanese film noir crime drama directed by Akira Kurosawa and starring Toshiro Mifune and Takashi Shimura. It is also considered a detective movie (among the earliest Japanese films in that genre) that explores the mood of Japan during its painful postwar recovery. The film is also considered a precursor to the contemporary police procedural and buddy cop film genres, based on its premise of pairing two cops with different personalities and motivations together on a difficult case.","Genre":{"Name":"Crime","Description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection. Stylistically, the genre may overlap and combine with many other genres, such as drama or gangster film, but also include comedy, and, in turn, is divided into many sub-genres, such as mystery, suspense or noir."},"ReleaseYear":"1949","Director":{"Name":"Akira Kurosawa","Bio":"Akira Kurosawa was a Japanese filmmaker who directed 30 films in a career spanning over five decades. He is widely regarded as one of the greatest and most influential filmmakers in the history of cinema. He displayed a bold, dynamic style, influenced by Western cinema yet distinct from it. He made his debut as a director during World War II with the popular action film Sanshiro Sugata (1943). After the war, the acclaimed Drunken Angel (1948), in which Kurosawa cast the then unknown actor Toshiro Mifune in a starring role, cemented his reputation as one of the most important young filmmakers in Japan. The two men would go on to collaborate on another fifteen films. Rashomon (1950), which premiered in Tokyo, became the surprise winner of the Golden Lion at the 1951 Venice Film Festival. The commercial and critical success of that film opened up Western film markets for the first time to the products of the Japanese film industry, which in turn led to international recognition for other Japanese filmmakers. His most prominent work includes: Ikiru (1952), Seven Samurai (1954), Throne of Blood (1957), Yojimbo (1961) and High and Low (1963), Kagemusha (1980) and Ran (1985).","Birth":"1910","Death":"1998"},"ImagePath":"1a30827982bfbea38fd2636f88a72be0.jpg (453×640) (pinimg.com)","Feature":true,"Title":"Stray Dog","bio":"Akira Kurosawa was a Japanese filmmaker who directed 30 films in a career spanning over five decades. He is regarded as one of the greatest and most influential filmmakers in the history of cinema. He displayed a bold, dynamic style, influenced by Western cinema yet distinct from it. He made his debut as a director during World War II with the popular action film Sanshiro Sugata (1943). After the war, the acclaimed Drunken Angel (1948), in which Kurosawa cast the then unknown actor Toshiro Mifune in a starring role, cemented his reputation as one of the most important young filmmakers in Japan. The two men would go on to collaborate on another fifteen films. Rashomon (1950), which premiered in Tokyo, became the surprise winner of the Golden Lion at the 1951 Venice Film Festival. The commercial and critical success of that film opened up Western film markets for the first time to the products of the Japanese film industry, which in turn led to international recognition for other Japanese filmmakers. His most prominent work includes: Ikiru (1952), Seven Samurai (1954), Throne of Blood (1957), Yojimbo (1961) and High and Low (1963), Kagemusha (1980) and Ran (1985)."}
{"_id":{"$oid":"64f63d022adbfe646492223d"},"Title":"Revenge","Description":"Revenge (Russian: Месть; romanised: mest; literally: Revenge; aka The Reed Flute)  is a Soviet  film taking place in a small Korean town in 1915. A group of young children are educated in a barn by a strict instructor, Yan. Losing his patience with the children, he takes his anger out on a young girl, scaring her into a corner of the barn and using a scythe to murder her. After realising his error, Yan goes into hiding. News of the girl’s murder reaches her parents and the girl’s father, Tsai, vows revenge. Tsai asks a friend to tend to his land while he sets off on a ten-year journey to kill the murderous instructor, who has fled to China. ‘Kazakh master Ermek Shinarbaev’s close collaboration with the Korean-Russian writer Anatoli Kim yielded three great films, the most remarkable of which is this beautiful, profoundly unsettling film. A true odyssey, geographically and psychologically. One of the greatest films to emerge from the Kazakh New Wave, and one of the toughest.’ (Kent Jones, 2010). Director’s take on: ‘In the beginning of the 40s, hundreds of thousands of Koreans that had lived in the Russian Far East since the XIX century were forcibly displaced overnight according to Stalin’s orders. They were regarded as traitors and public enemies. Women, children, old people, were sent away with no explanation. The Korean diaspora, with a population of over a million, has been a forbidden topic for many years. Revenge is the first film telling the story of their tragedy.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction intended to be more serious than humorous in tone. Drama of this kind is usually qualified with additional terms that specify its particular super-genre, macro-genre, or micro-genre, such as soap opera, police crime drama, political drama, legal drama, historical drama, teen drama, comedy drama. These terms tend to indicate a particular setting or subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods. To these ends, a primary element in a drama is the occurrence of conflict—emotional, social, or otherwise—and its resolution in the course of the storyline."},"ReleaseYear":"1989","Director":{"Name":"Yermek Shinarbayev","Bio":"Yermek Shinarbayev is a Soviet film director. Born in Alma-Ata, Soviet Union (now Almaty, Kazakhstan), Shinarbaev is sometimes categorised as a member of the Kazakh New Wave. He is especially well known for his collaboration with the Korean-Russian writer, Anatoli Kim, resulting to three films: My Sister Lucy (1985), Out of the Forest, into the Glade (1987), Revenge (1989) his very last film. The later was screened in the Un Certain Regard section at the 1991 Cannes Film Festival and won the grand prize at Sochi Open Russian Film Festival in 1990.","Birth":"1953","Death":"-"},"ImagePath":"d6ee5184-e86e-4b04-9af1-01d52065119a-cc714ba7.jpg (1280×720) (imgix.net)","Featured":false}
{"_id":{"$oid":"64fb8875dcf5f2ad100e6f4c"},"Title":"Three Sisters","Description":"Three Sisters (Chinese: 三姊妹; pinyin: Sān Zǐmèi, literally: three sisters) is a Chinese documentary film directed by Wang Bing. The film depicts three sisters (aged between four and ten years old) in their day-to-day life in rural China near the Sino-Burmese border. Abandoned by their mother and while their father seeks work in a nearby city, the film captures the bittersweet upbringing of the three sisters, their juvenile arguments and heartwarming mutual care. “An unquestionably eye-opening, deeply human, strikingly lensed look at an impoverished family whose rudimentary living conditions are a sharp riposte to the illusion of China’s economic boom.” —Jay Weissberg, Variety.","Genre":{"Name":"Documentary","Description":"A documentary film or documentary is a non-fictional motion-picture intended to \"document reality, primarily for the purposes of instruction, education or maintaining a historical record\". Bill Nichols has characterized the documentary in terms of \"a filmmaking practice, a cinematic tradition, and mode of audience reception [that remains] a practice without clear boundaries\". Early documentary films, originally called \"actuality films\", lasted one minute or less. Over time, documentaries have evolved to become longer in length, and to include more categories. Some examples are educational, observational and docufiction. Documentaries are very informative, and are often used within schools as a resource to teach various principles. Documentary filmmakers have a responsibility to be truthful to their vision of the world without intentionally misrepresenting a topic."},"ReleaseYear":"2012","Director":{"Name":"Wang Bing","Bio":"Wang Bing is a Chinese director, often referred to as one of the foremost figures in documentary film-making. Wang is the founder of his own production company, Wang Bing Studios, which produces most of his films. Tie Xi Qu, Wang’s 9 hour epic documentary of industrial China, was considered a major success. Tie Xi Qu went on to win the Grand Prix at the Marseille Festival of Documentary Film and was shown for the first time in Spain at the Punto de Vista International Documentary Film Festival. Wang’s film Fengming, a Chinese Memoir, premiered at both Cannes and Toronto in 2007. Crude Oil premiered at the 2008 Rotterdam Film Festival. Since then, his films became a staple at every prestigious international film festival. 2017’s Mrs. Fang was awarded the Golden Leopard at the 70th Locarno Festival.","Birth":"1967","Death":"-"},"ImagePath":"0854565002067_p0_v1_s1200x630.jpg (437×630) (images-bn.com)","Featured":false}
{"_id":{"$oid":"64fb8d53dcf5f2ad100e6f4d"},"Title":"In the Mood for Love","Description":"In the Mood for Love (Chinese: 花樣年華; pinyin: Huāyàng niánhuá; literally: Golden Years) is a romantic drama film written, produced and directed by Wong Kar-wai. A co-production between Hong Kong and France, it portrays a man (Tony Leung) and a woman (Maggie Cheung) whose spouses have an affair together and who slowly develop feelings for each other. It forms the second part of an informal trilogy, alongside Days of Being Wild and 2046. The film premiered at the Cannes Film Festival on 20 May 2000, to critical acclaim and a nomination for the Palme d’Or; Leung won Best Actor (the first Hong Kong actor to win the award). It is often listed as one of the greatest films of all time and one of the major works of Asian cinema. In a 2016 survey by the BBC, it was voted the second greatest film of the 21st century by 177 film critics from around the world, saying “never before has a film spoken so fluently in the universal language of loss and desire”. In 2022, the film placed 5th in Sight & Sound’s “Greatest Films of All Time” critics’ poll, rising from its previous position of 24th in 2012. It is the highest-ranked film between 1975 and 2022.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction intended to be more serious than humorous in tone. Drama of this kind is usually qualified with additional terms that specify its particular super-genre, macro-genre, or micro-genre, such as soap opera, police crime drama, political drama, legal drama, historical drama, teen drama, comedy drama. These terms tend to indicate a particular setting or subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods. To these ends, a primary element in a drama is the occurrence of conflict—emotional, social, or otherwise—and its resolution in the course of the storyline."},"ReleaseYear":"2000","Director":{"Name":"Wong Kar Wai","Bio":"Wong Kar Wai is a Hong Kong film director, screenwriter, and producer. His films are characterised by nonlinear narratives, atmospheric music, and vivid cinematography involving bold, saturated colours. A pivotal figure of Hong Kong cinema, Wong is considered a contemporary auteur, and ranks third on Sight & Sound’s 2002 poll of the greatest filmmakers of the previous 25 years. His films frequently appear on best-of lists domestically and internationally. Born in Shanghai, Wong emigrated to British Hong Kong as a child with his family. He began a career as a screenwriter for soap operas before transitioning to directing with his debut, the crime drama As Tears Go By (1988). While As Tears Go By was fairly successful in Hong Kong, Wong moved away from the contemporary trend of crime and action movies to embark on more personal filmmaking styles. Days of Being Wild (1990), his first venture in such a direction, did not perform well at the box office. It however received critical acclaim, and won Best Film and Best Director at the 1991 Hong Kong Film Awards. His next film, Ashes of Time (1994), met with a mixed reception because of its vague plot and atypical take on the wuxia genre. Exhausted by the time-consuming filming and post-production of Ashes of Time, Wong directed Chungking Express (1994), a smaller film that he hoped would rekindle his love of cinema. The film, expressing a more light-hearted atmosphere, catapulted Wong to international prominence, and won Best Film and Best Director at the 1995 Hong Kong Film Awards. Wong followed up with the crime thriller Fallen Angels in 1995. Although it was initially tepidly received by critics, Fallen Angels has since come to be considered a cult classic of the Golden Age of Hong Kong cinema, being especially representative of Wong’s style. Wong would go on to consolidate his worldwide reputation with the 1997 drama Happy Together, for which he won Best Director at the Cannes Film Festival. The 2000 drama In the Mood for Love, revered for its lush visuals and subtle storytelling, concretely established Wong’s trademark filmmaking styles. Among his other works are 2046 (2004) and The Grandmaster (2013), both of which received awards and nominations worldwide.","Birth":"1958","Death":"-"},"ImagePath":"c8da230b437943e8b8a3d17724618c2c.jpg (700×959) (pinimg.com)","Featured":false}
{"_id":{"$oid":"64fb9262dcf5f2ad100e6f4e"},"Title":"Mirror","Description":"Mirror (Russian: Зеркало; romanized: Zerkalo; literally: mirror) is a Soviet drama film directed by Andrei Tarkovsky. It is loosely autobiographical, unconventionally structured, and incorporates poems composed and read by the director’s father, Arseny Tarkovsky. The film features Margarita Terekhova, Ignat Daniltsev, Alla Demidova, Anatoly Solonitsyn, Tarkovsky’s wife Larisa Tarkovskaya and his mother Maria Vishnyakova. Innokenty Smoktunovsky provides voiceover and Eduard Artemyev the incidental music and sound effects. Mirror is structured in the form of a nonlinear narrative, with its main concept dating back to 1964 and undergoing multiple scripted versions by Tarkovsky and Aleksandr Misharin. It unfolds around memories recalled by a dying poet of key moments in his life and in Soviet culture. The film combines contemporary scenes with childhood memories, dreams, and newsreel footage. Its cinematography slips between colour, black-and-white, and sepia. The film’s loose flow of oneiric images has been compared with the stream of consciousness technique associated with modernist literature. Mirror initially polarised critics and audiences, with many finding its narrative incomprehensible. Since its release, it has been reappraised as one of the greatest films of all time. It has especially found favour with many Russians, for whom it remains their most beloved of Tarkovsky’s works.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction intended to be more serious than humorous in tone. Drama of this kind is usually qualified with additional terms that specify its particular super-genre, macro-genre, or micro-genre, such as soap opera, police crime drama, political drama, legal drama, historical drama, teen drama, comedy drama. These terms tend to indicate a particular setting or subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods. To these ends, a primary element in a drama is the occurrence of conflict—emotional, social, or otherwise—and its resolution in the course of the storyline."},"ReleaseYear":"1975","Director":{"Name":"Andrei Tarkovsky","Bio":"Andrei Arsenyevich Tarkovsky was a Russian film director and screenwriter. Widely considered one of the greatest and most influential directors in cinema history, Tarkovsky’s films explore spiritual and metaphysical themes, and are noted for their slow pacing and long takes, dreamlike visual imagery, and preoccupation with nature and memory. Tarkovsky studied film at Moscow’s VGIK under filmmaker Mikhail Romm, and subsequently directed his first five features in the Soviet Union: Ivan’s Childhood (1962), Andrei Rublev (1966), Solaris (1972), Mirror (1975), and Stalker (1979). A number of his films from this period are ranked among the best films ever made. After years of creative conflict with state film authorities, Tarkovsky left the country in 1979 and made his final two films abroad; Nostalghia (1983) and The Sacrifice (1986) were produced in Italy and Sweden respectively. In 1986, he also published a book about cinema and art entitled Sculpting in Time. He died later that year of cancer, a condition possibly caused by the toxic locations used in the filming of Stalker. Tarkovsky was the recipient of several awards at the Cannes Film Festival throughout his career, including the FIPRESCI prize, the Prize of the Ecumenical Jury, and the Grand Prix Spécial du Jury. He was also awarded the Golden Lion at the Venice Film Festival for his debut film, Ivan’s Childhood. In 1990, he was posthumously awarded the Soviet Union’s prestigious Lenin Prize. Three of his films—Andrei Rublev, Mirror, and Stalker—featured in Sight & Sound’s 2012 poll of the 100 greatest films of all time.","Birth":"1932","Death":"1986"},"ImagePath":"MirrorTarkovskyNewposterbigm5991.jpg (800×1178) (firstshowing.net)","Featured":false}
{"_id":{"$oid":"64fb96a0dcf5f2ad100e6f4f"},"Title":"Wings of Desire","Description":"Wings of Desire (German: Der Himmel über Berlin) is a romantic fantasy film written by Wim Wenders, Peter Handke and Richard Reitinger, and directed by Wenders. The film is about invisible, immortal angels who populate Berlin and listen to the thoughts of its human inhabitants, comforting the distressed. Even though the city is densely populated, many of the people are isolated or estranged from their loved ones. One of the angels, played by Bruno Ganz, falls in love with a beautiful, lonely trapeze artist, played by Solveig Dommartin. The angel chooses to become mortal so that he can experience human sensory pleasures, ranging from enjoying food to touching a loved one, and so that he can discover human love with the trapeze artist. Inspired by art depicting angels visible around West Berlin, at the time encircled by the Berlin Wall, Wenders and author Peter Handke conceived of the story and continued to develop the screenplay throughout the French and German co-production. The film was shot by Henri Alekan in both colour and a sepia-toned black-and-white, the latter being used to represent the world as seen by the angels. The cast includes Otto Sander, Curt Bois and Peter Falk. For Wings of Desire, Wenders won awards for Best Director at both the Cannes Film Festival and European Film Awards. The film was a critical and financial success, and academics have interpreted it as a statement of the importance of cinema, libraries, the circus, or German unity, containing New Age, religious, secular or other themes. It was followed by a sequel, Faraway, So Close!, released in 1993. In 1990, numerous critics named Wings of Desire as one of the best films of the 1980s.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and usually inspired by mythology or folklore. Its roots are in oral traditions, which became fantasy literature and drama. From the twentieth century, it has expanded further into various media, including film. Fantasy is distinguished from the genres of science fiction and horror by the absence of scientific or macabre themes, although these can occur in fantasy. In popular culture, the fantasy genre predominantly features settings that emulate Earth, but with a sense of otherness. In its broadest sense, however, fantasy consists of works by many writers, artists, filmmakers, and musicians from ancient myths and legends to many recent and popular works."},"ReleaseYear":"1987","Director":{"Name":"Wim Wenders","Bio":"Ernst Wilhelm ‘Wim Wenders’ is a German filmmaker, playwright, author, and photographer. He is a major figure in New German Cinema. Among many honours, he has received three nominations for the Academy Award for Best Documentary Feature: for Buena Vista Social Club (1999), about Cuban music culture; Pina (2011), about the contemporary dance choreographer Pina Bausch; and The Salt of the Earth (2014), about Brazilian photographer Sebastião Salgado. One of Wenders’s earliest honours was a win for the BAFTA Award for Best Direction for his narrative drama Paris, Texas (1984), which also won the Palme d’Or at the 1984 Cannes Film Festival. Many of his subsequent films have also been recognised at Cannes, including Wings of Desire (1987), for which he won the Best Director Award at the 1987 Cannes Film Festival. Wenders has been the president of the European Film Academy in Berlin since 1996. Alongside filmmaking, he is an active photographer, emphasising images of desolate landscapes. He is considered an auteur director.","Birth":"1945","Death":"-"},"ImagePath":"a250b1c7b7399d5c98a1af7104468ca0.jpg (720×1080) (pantaflix.com)","Featured":false}
{"_id":{"$oid":"64fb9816dcf5f2ad100e6f50"},"Title":"Ashes and Diamonds","Description":"Ashes and Diamonds (Polish: Popiół i diament; literally: Ashes and diamonds ) is a Polish drama film directed by Andrzej Wajda, based on the 1948 novel by Polish writer Jerzy Andrzejewski. Starring Zbigniew Cybulski and Ewa Krzyżewska, it completed Wajda’s war films trilogy, following A Generation (1954) and Kanal (1956). The action of Ashes and Diamonds takes place in 1945, shortly after World War II. The main protagonist of the film, former Home Army soldier Maciek Chełmicki, is acting in the anti-Communist underground. Maciek receives an order to kill Szczuka, the local secretary of the Polish Workers’ Party. Over time, Chełmicki increasingly doubts if his task is worth doing. Ashes and Diamonds, although based on the novel that directly supported the postwar Communist system in Poland, was subtly modified in comparison with the source material. Wajda sympathised with the soldiers of the Polish independence underground; thus, he devoted most of the attention to Chełmicki. At first, Ashes and Diamonds met positive critical reception, both in Poland and worldwide. However, after the Revolutions of 1989, it was criticised for falsifying the collective memory of Polish partisans. Nevertheless, the film has maintained its reputation as one of the most famous Polish motion pictures in history.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction intended to be more serious than humorous in tone. Drama of this kind is usually qualified with additional terms that specify its particular super-genre, macro-genre, or micro-genre, such as soap opera, police crime drama, political drama, legal drama, historical drama, teen drama, comedy drama. These terms tend to indicate a particular setting or subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods. To these ends, a primary element in a drama is the occurrence of conflict—emotional, social, or otherwise—and its resolution in the course of the storyline."},"ReleaseYear":"1958","Director":{"Name":"Andrzej Wajdy","Bio":"Andrzej Wajdy was a Polish film and theatre director. Recipient of an Honorary Oscar, the Palme d'Or, as well as Honorary Golden Lion and Honorary Golden Bear Awards, he was a prominent member of the ‘Polish Film School’. He was known especially for his trilogy of war films consisting of A Generation (1955), Kanał (1957) and Ashes and Diamonds (1958). He is considered one of the world's most renowned filmmakers, whose works chronicled his native country’s political and social evolution and dealt with the myths of Polish national identity offering insightful analyses of the universal element of the Polish experience – the struggle to maintain dignity under the most trying circumstances. Four of his films have been nominated for the Academy Award for Best Foreign Language Film: The Promised Land (1975), The Maids of Wilko (1979), Man of Iron (1981) and Katyń (2007).","Birth":"1926","Death":"2016"},"ImagePath":"d7e1b092cf125ae740a9cefa10d50d5d.jpg (1000×1764) (pinimg.com)","Featured":false}
{"_id":{"$oid":"64fb9a0cdcf5f2ad100e6f51"},"Title":"Tampopo","Description":"Goro, truck driver, stops at a small family noodle shop run by Lai Lai and decides to help her fledgling business. Through clever trickery, they pry ramen secrets from their competitors. The story is intertwined with various vignettes about the relationship of love and food: a group of business executives visit a French restaurant but have no idea how to order and are upstaged by a surprisingly worldly subordinate. A women’s etiquette class on how to eat spaghetti silently in the European manner abruptly changes course on observing a white man slurping his noodles. A supermarket clerk catches an aged woman obsessed with squeezing food. A con man uses an elaborate meal to lure a victim into an investment scam; the victim is himself a thief but is so taken by the meal that he fails to leave with the con man’s wallet before being arrested. A housewife rises from her deathbed to cook one last meal for her family, who mournfully eat to memorialise her. A man and his lover explore erotic ways to use food. The man is ultimately shot several times by an unknown assailant, to his lover’s horror, though he is satisfied at the end of his life and hopes to see it play out like a film. A woman on a park bench breastfeeds an infant. Tampopo(Japanese: タンポポ; romaji: Tanpopo; literally: dandelion)  is a Japanese comedy film written and directed by Juzo Itami, and starring Tsutomu Yamazaki, Nobuko Miyamoto, Kōji Yakusho, and Ken Watanabe. The publicity for the film calls it the first ‘ramen western’, a play on the term Spaghetti Western (films about the American Old West made by Italian production studios). Tampopo received two Japanese Academy Awards: for Best Editing and for Best Sound. In the United States, it was nominated for an Independent Spirit Award for Best Foreign Film and a National Society of Film Critics Award for Best Screenplay and Best Director.","Genre":{"Name":"Comedy","Description":"Comedy is a genre emphasising on humour. These films are designed to make the public laugh in amusement and traditionally have a happy ending. It is one of the oldest genres in the film and is derived from classical comedy in theatre. Comedy, compared with other film genres, places more focus on individual star actors, with many former stand-up comics transitioning to the film industry due to their popularity. A number of hybrid genres use comedy, such as action comedy and the romantic comedy. It can take many forms, including stand-up comedy, sketch comedy, sitcoms, and comedic films. Comedy often uses satire to comment on social, political issues and everyday life. Physical comedy, which uses gestures, facial expressions and body language to create humour, is also a popular form of comedy. The genre of comedy is known for its ability to make people laugh, but also make them think, and it can be a reflection of society and its issues."},"ReleaseYear":"1985","Director":{"Name":"Juzo Itami","Bio":"Juzo Itami, born Yoshihiro Ikeuchi, was a Japanese actor, screenwriter and film director. He directed eleven films, all of which he wrote himself. His debut as director was the movie The Funeral (Osōshiki) in 1984, at the age of 50. This film proved popular in Japan and won many awards, including Japanese Academy Awards for Best Picture, Best Director, and Best Screenplay. However, it was his second movie, the 1985 ‘noodle western’ Tampopo, that earned him international exposure and acclaim. Itami directed the anti-yakuza satire Minbo: the Gentle Art of Japanese Extortion (1992). Six days after the release of the film, Itami was attacked, beaten, and slashed on the face by five members of the Goto-gumi yakuza clan, who were angry at Itami’s film’s portrayal of gang members. In an interview with the New York Times, he described the attack, saying, “They cut very slowly; they took their time. They could have killed me if they wanted.” This attack led to a government crackdown on the yakuza. His subsequent stay in a hospital inspired his next film Daibyonin (1993), a grim satire on the Japanese health system. During a showing of this film in Japan, a cinema screen was slashed by a right-wing protester.","Birth":"1933","Death":"1997"},"ImagePath":"tampopo-poster.jpg (800×1170) (thefilmstage.com)","Featured":false}
{"_id":{"$oid":"64fb9e15dcf5f2ad100e6f52"},"Title":"Persona","Description":"Persona is a Swedish avant-garde psychological drama written, directed, and produced by Ingmar Bergman and starring Bibi Andersson and Liv Ullmann. The story revolves around a young nurse named Alma (Andersson) and her patient, well-known stage actress Elisabet Vogler (Ullmann), who has suddenly stopped speaking. They move to a cottage, where Alma cares for Elisabet, confides in her, and begins having trouble distinguishing herself from her patient. Characterised by elements of psychological horror, Persona has been the subject of much critical analysis, interpretation, and debate. The film’s exploration of duality, insanity, and personal identity has been interpreted as reflecting the Jungian theory of persona and dealing with issues related to filmmaking, vampirism, homosexuality, motherhood, abortion, and other subjects. The experimental style of its prologue, storytelling, and end has also been noted. The enigmatic film has been called the Mount Everest of cinematic analysis; according to film historian Peter Cowie, \"Everything one says about Persona may be contradicted; the opposite will also be true\". Many critics consider Persona one of the greatest films ever made, Bergman's magnum opus, and a work of art of experimental cinema, and Andersson's and Ullmann’s performances two of the best female performances in movie history. Persona is also considered one of the most difficult and complex films. It was ranked fifth in Sight & Sound’s 1972 poll and 17th in 2012. It also influenced many directors, including Robert Altman and David Lynch.","Genre":{"Name":"Avant-garde","Description":"In the arts and in literature, the term avant-garde identifies a genre of art, an experimental work of art, and the experimental artist who created the work of art, which usually is aesthetically innovative, whilst initially being ideologically unacceptable to the artistic establishment of the time. The military metaphor of an advance guard identifies the artists’ work as ahead of their time and thus challenging. As intellectuals, avant-garde artists promote progressive and radical politics and advocate for societal reform with and through works of art. In art history the socio-cultural functions of avant-garde art trace from Dada (1915–1920s) through the Situationist International (1957–1972) to the postmodernist movement (1950s–1960s)."},"ReleaseYear":"1966","Director":{"Name":"Ingmar Bergman","Bio":"Ingmar Bergman was a Swedish filmmaker and theatre director. Widely considered one of the greatest and most influential screenwriters and film directors of all time, his films have been described as ‘profoundly personal meditations into the myriad struggles facing the psyche and the soul’. Some of his most acclaimed works include The Seventh Seal (1957), Wild Strawberries (1957), Persona (1966), and Fanny and Alexander (1982); these four films were included in the 2012 edition of Sight & Sound’s Greatest Films of All Time. Bergman was also ranked No. 8 on the magazine’s 2002 ‘Greatest Directors of All Time’ list.","Birth":"1918","Death":"2007"},"ImagePath":"bjPo1GDN1DaXcg8ecSzwLTLdbbv.jpg (1818×2727) (tmdb.org)","Featured":false}
{"_id":{"$oid":"64fb9f23dcf5f2ad100e6f53"},"Title":"The Voice of the Moon","Description":"The Voice of the Moon (Italian: la voce della luna; literally: the voice of the moon) is an Italian dramatic fantasy film directed and written by Federico Fellini and starring Roberto Benigni, Paolo Villaggio, and Nadia Ottaviani. Based on the novel Il poema dei lunatici by Ermano Cavazzoni, and revisiting themes Fellini first explored in La strada (1954), the film is about a fake inspector of wells and a former prefect who wander through the Emilia-Romagna countryside of Fellini’s childhood and discover a dystopia of television commercials, fascism, beauty pageants, rock music, Catholicism, and pagan ritual. The film received David di Donatello Awards for Best Actor, Best Editing, and Best Production Design, and nominations for Best Director, Best Film, Best Cinematography, Best Music, and Best Producer. The Voice of the Moon was Fellini’s last film before his death in 1993. With a nod to the lunar-obsessed lyrics of Italian poet Giacomo Leopardi, the acerbic tale focuses on the capture of the moon by the Micheluzzi Brothers while Ivo, newly released from a mental hospital, tries to seduce Aldina Ferruzzi with whom he's infatuated. Although she wants nothing to do with him, Ivo equates her blond beauty with the moon, the origin of his madness and frustration. During the attempts to woo her, he meets various madcap characters including an oboist who sleeps in the local cemetery, a man whose hobby is meditating on rooftops, and Gonnella, the ex-prefect fired for his rising paranoia. Gonnella makes Ivo his lieutenant and together they investigate the ‘wild conspiracies’ going on around them.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and usually inspired by mythology or folklore. Its roots are in oral traditions, which became fantasy literature and drama. From the twentieth century, it has expanded further into various media, including film. Fantasy is distinguished from the genres of science fiction and horror by the absence of scientific or macabre themes, although these can occur in fantasy. In popular culture, the fantasy genre predominantly features settings that emulate Earth, but with a sense of otherness. In its broadest sense, however, fantasy consists of works by many writers, artists, filmmakers, and musicians from ancient myths and legends to many recent and popular works."},"ReleaseYear":"1990","Director":{"Name":"Federico Fellini","Bio":"Federico Fellini was an Italian filmmaker. He is known for his distinctive style, which blends fantasy and baroque images with earthiness. He is recognised as one of the greatest and most influential filmmakers of all time. His films have ranked highly in critical polls such as that of Cahier du Cinema and Sight & Sound, which lists his 1963 film 8 1⁄2 as the 10th-greatest film.","Birth":"1920","Death":"1993"},"ImagePath":"黑澤考克看電影！（前狂人影癡）: Image (wordpress.com)","Featured":false}
